#include <stdint.h>
#include <unistd.h>
#include <stdio.h>
#include <stdlib.h>

void ReceiveSub(char *data);//接收数据处理
void udp_read_devMsg_from_config_db();
/*==================================================================================
* 函 数 名： udp_instance_init
* 参    数： None
* 功能描述:  udp初始化
* 返 回 值： None
* 备    注： None
* 作    者： xiaozh
* 创建时间： 2019-10-28 170617
=================================================================================*/
void udp_instance_init(void);

/*==================================================================================
* 函 数 名： udp_push_data_msg
* 参    数： None
* 功能描述:  udp 接收到数据后调用此函数把接收的数据添加的队列里面
* 返 回 值： None
* 备    注： 
* 作    者： lc
* 创建时间： 2021-09-29 170658
==================================================================================*/
void udp_push_data_msg(void* ret_msg);
